cask_args appdir: '/Applications' # specify a directory to install

brew 'cocoapods'     # Swift package manager
brew 'exa'           # colorful version of ls
brew 'exiftool'      # manage photo EXIF metadata
brew 'httpie'        # command line HTTP client
brew 'imagemagick'   # create, edit, compose, or convert bitmap images
# brew 'dockutil'      # manage dock apps from command-line
brew 'ffmpeg'        # play, record, convert, and stream audio and video
brew 'git'           # the most widely used version control system
brew 'git-flow-avh'  # AVH version of git-flow
# brew 'grip'          # gihub flavored Markdown
brew 'fzf'           # a fuzzy command-line finder
brew 'mas'           # Mac App Store command line interface
brew 'openssl'       # TLS/SSL and crypto library
brew 'node'          # also installs `npm` using the recommended method
brew 'python3'       # newer python than macOS comes with
brew 'rsync'         # a fast remote (and local) file-copying tool
brew 'scmpuff'       # reference git files using numbers (git add 1-3)
brew 'speedtest-cli' # command line speed test
brew 'the_silver_searcher' # A code-searching tool similar to ack, but faster.
brew 'trash'         # CLI tool that moves files or folder to the trash
brew 'tree'          # depth indented directory listing command
brew 'unrar'         # extract, view, and test RAR archives
brew 'wget'          # Wget git mirror
brew 'yarn'          # dependency manager
brew 'youtube-dl'    # download youtube videos
brew 'zopfli'        # compression library programmed in C to perform very good, but slow, deflate or zlib compression
brew 'zsh'           # mirror of the Z shell source code repository

brew 'swiftlint'     # a tool to enforce Swift style and conventions (requires xcode)
brew 'swiftformat'   # command-line tool and Xcode Extension for formatting Swift code

cask '1password'
cask 'alfred'
cask 'atom'
cask 'bartender'
cask 'brave-browser'
cask 'calibre'
cask 'disk-inventory-x'
cask 'imageoptim'
cask 'iterm2'
cask 'karabiner-elements'
cask 'licecap'
cask 'macvim'
cask 'nordvpn'
cask 'realm-studio'
cask 'screenflow'
cask 'sourcetree'
cask 'the-unarchiver'
cask 'tor-browser'
cask 'transmission'
cask 'vlc'

tap 'homebrew/cask-fonts' || true
cask 'homebrew/cask-fonts/font-saucecodepro-nerd-font'
cask 'homebrew/cask-fonts/font-fira-code-nerd-font'
